{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 500, "input_dtype": "float32", "activity_regularizer": null, "activation": "relu", "batch_input_shape": [null, 561], "bias": true, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": 561, "name": "encoder1", "trainable": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 500, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "name": "encoder2", "trainable": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 2000, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "name": "encoder3", "trainable": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 10, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "bias": true, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "name": "encoder4", "trainable": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 2000, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "name": "decoder1", "trainable": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 500, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "name": "decoder2", "trainable": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 500, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "name": "decoder3", "trainable": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 561, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "bias": true, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "name": "decoder4", "trainable": true, "b_regularizer": null}}], "keras_version": "1.0.8"}