{"config": [{"config": {"W_regularizer": null, "W_constraint": null, "output_dim": 500, "activity_regularizer": null, "bias": true, "b_constraint": null, "batch_input_shape": [null, 784], "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "input_dim": 784, "b_regularizer": null, "name": "encoder1", "activation": "relu"}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "output_dim": 500, "activity_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "W_constraint": null, "name": "encoder2", "activation": "relu"}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "output_dim": 2000, "activity_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "W_constraint": null, "name": "encoder3", "activation": "relu"}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "output_dim": 10, "activity_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "W_constraint": null, "name": "encoder4", "activation": "linear"}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "output_dim": 2000, "activity_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "W_constraint": null, "name": "decoder1", "activation": "relu"}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "output_dim": 500, "activity_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "W_constraint": null, "name": "decoder2", "activation": "relu"}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "output_dim": 500, "activity_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "W_constraint": null, "name": "decoder3", "activation": "relu"}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "output_dim": 784, "activity_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "input_dim": null, "W_constraint": null, "name": "decoder4", "activation": "sigmoid"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.0.8"}