{"keras_version": "1.0.8", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "name": "encoder1", "input_dim": 2000, "activation": "relu", "b_regularizer": null, "bias": true, "input_dtype": "float32", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "batch_input_shape": [null, 2000], "output_dim": 500}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "name": "encoder2", "input_dim": null, "activation": "relu", "b_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 500}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "name": "encoder3", "input_dim": null, "activation": "relu", "b_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 2000}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "name": "encoder4", "input_dim": null, "activation": "linear", "b_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 10}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "name": "decoder1", "input_dim": null, "activation": "relu", "b_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 2000}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "name": "decoder2", "input_dim": null, "activation": "relu", "b_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 500}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "name": "decoder3", "input_dim": null, "activation": "relu", "b_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 500}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "name": "decoder4", "input_dim": null, "activation": "linear", "b_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 2000}}]}