{"class_name": "Model", "keras_version": "1.0.8", "config": {"layers": [{"class_name": "InputLayer", "name": "input_10", "inbound_nodes": [], "config": {"batch_input_shape": [null, 10], "input_dtype": "float32", "name": "input_10"}}, {"class_name": "Dense", "name": "dense_62", "inbound_nodes": [[["input_10", 0, 0]]], "config": {"output_dim": 1000, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "dense_62", "b_constraint": null, "input_dim": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "bias": true}}, {"class_name": "Dense", "name": "dense_63", "inbound_nodes": [[["dense_62", 0, 0]]], "config": {"output_dim": 500, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "dense_63", "b_constraint": null, "input_dim": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "bias": true}}, {"class_name": "Dense", "name": "dense_64", "inbound_nodes": [[["dense_63", 0, 0]]], "config": {"output_dim": 500, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "dense_64", "b_constraint": null, "input_dim": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "bias": true}}, {"class_name": "Dense", "name": "dense_65", "inbound_nodes": [[["dense_64", 0, 0]]], "config": {"output_dim": 784, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "name": "dense_65", "b_constraint": null, "input_dim": null, "activation": "sigmoid", "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "bias": true}}], "input_layers": [["input_10", 0, 0]], "output_layers": [["dense_65", 0, 0]], "name": "model_25"}}